Repository: JongHyeonPP/FileViewer
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, hi, ja, ko, pt, ru, zh, zh_tw

# appTitle
source: File Viewer
ar: عارض الملفات
de: Dateibetrachter
es: Visor de archivos
fr: Visionneuse de fichiers
hi: फ़ाइल व्यूअर
ja: ファイルビューア
ko: 파일 뷰어
pt: Visualizador de arquivos
ru: Просмотрщик файлов
zh: 文件查看器
zh_tw: 檔案檢視器

# homeTitle
source: File Home
ar: الصفحة الرئيسية للملفات
de: Datei Startseite
es: Inicio de archivos
fr: Accueil des fichiers
hi: फ़ाइल होम
ja: ファイルホーム
ko: 파일 홈
pt: Início dos arquivos
ru: Главная файлов
zh: 文件主页
zh_tw: 檔案首頁

# buttonOpenExplorer
source: Open explorer
ar: فتح المستكشف
de: Explorer öffnen
es: Abrir explorador
fr: Ouvrir l’explorateur
hi: एक्सप्लोरर खोलें
ja: エクスプローラーを開く
ko: 탐색기 열기
pt: Abrir explorador
ru: Открыть проводник
zh: 打开文件管理器
zh_tw: 開啟檔案管理器

# filterAllFiles
source: All files
ar: كل الملفات
de: Alle Dateien
es: Todos los archivos
fr: Tous les fichiers
hi: सभी फ़ाइलें
ja: すべてのファイル
ko: 모든 파일
pt: Todos os arquivos
ru: Все файлы
zh: 所有文件
zh_tw: 所有檔案

source: No recent files
ar: لا توجد ملفات حديثة
de: Keine zuletzt geöffneten Dateien
es: No hay archivos recientes
fr: Aucun fichier récent
hi: हाल की कोई फ़ाइल नहीं
ja: 最近開いたファイルはありません
ko: 최근 열린 파일이 없습니다
pt: Não há arquivos recentes
ru: Нет недавних файлов
zh: 没有最近打开的文件
zh_tw: 沒有最近開啟的檔案

# noFilteredFiles
source: No files for this filter
ar: لا توجد ملفات حديثة لهذا المرشح
de: Keine zuletzt geöffneten Dateien für diesen Filter
es: No hay archivos recientes para este filtro
fr: Aucun fichier récent pour ce filtre
hi: इस फ़िल्टर के लिए हाल की कोई फ़ाइल नहीं
ja: 条件に一致する最近のファイルはありません
ko: 해당 조건의 최근 파일이 없습니다
pt: Não há arquivos recentes para este filtro
ru: Нет недавних файлов для этого фильтра
zh: 没有符合条件的最近文件
zh_tw: 沒有符合條件的最近檔案

# exitDialogTitle
source: Exit app
ar: إنهاء التطبيق
de: App beenden
es: Salir de la app
fr: Quitter l’application
hi: ऐप से बाहर निकलें
ja: アプリを終了しますか
ko: 앱을 종료하시겠습니까
pt: Sair do app
ru: Выйти из приложения
zh: 退出应用
zh_tw: 結束應用程式

# exitDialogContent
source: The app will close if you choose to exit
ar: سيتم إغلاق التطبيق إذا اخترت الإنهاء
de: Die App wird geschlossen wenn Sie Beenden wählen
es: La app se cerrará si eliges salir
fr: L’application se fermera si vous quittez
hi: बाहर निकलने पर ऐप बंद हो जाएगा
ja: 終了を選択するとアプリが閉じられます
ko: 종료하기를 누르면 앱이 종료됩니다
pt: O app será fechado se você sair
ru: Приложение будет закрыто если вы выберете выход
zh: 选择退出后应用将关闭
zh_tw: 選擇結束後應用程式將關閉

# exitDialogCancel
source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
hi: रद्द करें
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
zh: 取消
zh_tw: 取消

# exitDialogConfirm
source: Exit
ar: إنهاء
de: Beenden
es: Salir
fr: Quitter
hi: बाहर निकलें
ja: 終了
ko: 종료하기
pt: Sair
ru: Выйти
zh: 退出
zh_tw: 結束

# viewerTitle
source: File viewer
ar: عارض الملفات
de: Dateibetrachter
es: Visor de archivos
fr: Visionneuse de fichiers
hi: फ़ाइल व्यूअर
ja: ファイルビューア
ko: 파일 뷰어
pt: Visualizador de arquivos
ru: Просмотрщик файлов
zh: 文件查看器
zh_tw: 檔案檢視器

# goHomeTooltip
source: Back to home
ar: الرجوع إلى الصفحة الرئيسية
de: Zur Startseite
es: Volver al inicio
fr: Retour à l’accueil
hi: होम पर वापस जाएँ
ja: ホームに戻る
ko: 홈으로 돌아가기
pt: Voltar ao início
ru: На главный экран
zh: 返回主页
zh_tw: 返回首頁

# openAnotherFileTooltip
source: Open another file
ar: فتح ملف آخر
de: Andere Datei öffnen
es: Abrir otro archivo
fr: Ouvrir un autre fichier
hi: दूसरी फ़ाइल खोलें
ja: 別のファイルを開く
ko: 다른 파일 열기
pt: Abrir outro arquivo
ru: Открыть другой файл
zh: 打开其他文件
zh_tw: 開啟其他檔案

# errorWhileOpeningFile
source: An error occurred while opening the file
ar: حدث خطأ أثناء فتح الملف
de: Beim Öffnen der Datei ist ein Fehler aufgetreten
es: Se produjo un error al abrir el archivo
fr: Une erreur est survenue lors de l’ouverture du fichier
hi: फ़ाइल खोलते समय त्रुटि हुई
ja: ファイルを開く際にエラーが発生しました
ko: 파일을 여는 중 오류가 발생했습니다
pt: Ocorreu um erro ao abrir o arquivo
ru: Произошла ошибка при открытии файла
zh: 打开文件时发生错误
zh_tw: 開啟檔案時發生錯誤

# errorPdfDisplay
source: An error occurred while displaying the PDF
ar: حدث خطأ أثناء عرض ملف PDF
de: Beim Anzeigen der PDF ist ein Fehler aufgetreten
es: Se produjo un error al mostrar el PDF
fr: Une erreur est survenue lors de l’affichage du PDF
hi: PDF दिखाते समय त्रुटि हुई
ja: PDF の表示中にエラーが発生しました
ko: PDF 표시 중 오류가 발생했습니다
pt: Ocorreu um erro ao exibir o PDF
ru: Произошла ошибка при отображении PDF
zh: 显示 PDF 时发生错误
zh_tw: 顯示 PDF 時發生錯誤

# errorOfficeDisplay
source: An error occurred while loading the office document
ar: حدث خطأ أثناء تحميل مستند Office
de: Beim Laden des Office Dokuments ist ein Fehler aufgetreten
es: Se produjo un error al cargar el documento de Office
fr: Une erreur est survenue lors du chargement du document Office
hi: Office दस्तावेज़ लोड करते समय त्रुटि हुई
ja: Office 文書の読み込み中にエラーが発生しました
ko: 오피스 문서를 불러오는 중 오류가 발생했습니다
pt: Ocorreu um erro ao carregar o documento do Office
ru: Произошла ошибка при загрузке документа Office
zh: 加载 Office 文档时发生错误
zh_tw: 載入 Office 文件時發生錯誤

# errorTextEncodingUnknown
source: Cannot detect text file encoding
ar: يتعذر تحديد ترميز ملف النص
de: Textkodierung der Datei kann nicht erkannt werden
es: No se puede detectar la codificación del archivo de texto
fr: Impossible de détecter l’encodage du fichier texte
hi: टेक्स्ट फ़ाइल की एन्कोडिंग का पता नहीं चला
ja: テキストファイルのエンコーディングを判別できません
ko: 텍스트 파일의 인코딩을 알 수 없습니다
pt: Não foi possível detectar a codificação do arquivo de texto
ru: Не удалось определить кодировку текстового файла
zh: 无法识别文本文件的编码
zh_tw: 無法辨識文字檔的編碼

# errorTextReload
source: An error occurred while reopening the text file
ar: حدث خطأ أثناء إعادة فتح ملف النص
de: Beim erneuten Öffnen der Textdatei ist ein Fehler aufgetreten
es: Se produjo un error al volver a abrir el archivo de texto
fr: Une erreur est survenue lors de la réouverture du fichier texte
hi: टेक्स्ट फ़ाइल फिर से खोलते समय त्रुटि हुई
ja: テキストファイルを再読み込み中にエラーが発生しました
ko: 텍스트 파일을 다시 여는 중 오류가 발생했습니다
pt: Ocorreu um erro ao reabrir o arquivo de texto
ru: Произошла ошибка при повторном открытии текстового файла
zh: 重新打开文本文件时发生错误
zh_tw: 重新開啟文字檔時發生錯誤

# errorUnsupportedFormat
source: Unsupported file format
ar: تنسيق ملف غير مدعوم
de: Nicht unterstütztes Dateiformat
es: Formato de archivo no compatible
fr: Format de fichier non pris en charge
hi: असमर्थित फ़ाइल फ़ॉर्मैट
ja: サポートされていないファイル形式です
ko: 지원하지 않는 파일 형식입니다
pt: Formato de arquivo não compatível
ru: Неподдерживаемый формат файла
zh: 不支持的文件格式
zh_tw: 不支援的檔案格式

# externalOpenInfo
source: {fileType} file was opened with default system app
ar: تم فتح ملف {fileType} باستخدام تطبيق النظام الافتراضي
de: Die Datei {fileType} wurde mit der Standard System App geöffnet
es: El archivo {fileType} se abrió con la aplicación predeterminada del sistema
fr: Le fichier {fileType} a été ouvert avec l’application système par défaut
hi: {fileType} फ़ाइल सिस्टम की डिफ़ॉल्ट ऐप से खोली गई
ja: {fileType} ファイルは端末の既定アプリで開きました
ko: {fileType} 파일은 기기 기본 앱으로 열었습니다
pt: O arquivo {fileType} foi aberto com o aplicativo padrão do sistema
ru: Файл {fileType} открыт стандартным приложением системы
zh: {fileType} 文件已用系统默认应用打开
zh_tw: 已使用系統預設應用程式開啟 {fileType} 檔案

# externalOnlyInfo
source: This file type can only be opened with a system viewer
ar: لا يمكن فتح هذا النوع من الملفات إلا باستخدام تطبيق النظام
de: Dieser Dateityp kann nur mit einer System App geöffnet werden
es: Este tipo de archivo solo puede abrirse con una aplicación del sistema
fr: Ce type de fichier ne peut être ouvert qu’avec une application système
hi: इस फ़ाइल प्रकार को केवल सिस्टम ऐप से खोला जा सकता है
ja: このファイル形式は端末のアプリでのみ開けます
ko: 이 파일 형식은 기기 기본 앱에서만 열 수 있습니다
pt: Este tipo de arquivo só pode ser aberto com um aplicativo do sistema
ru: Этот тип файла можно открыть только системным приложением
zh: 此文件格式只能用系统应用打开
zh_tw: 此檔案格式僅能使用系統應用程式開啟

# unsupportedHere
source: This file type is not supported in this version
ar: هذا النوع من الملفات غير مدعوم في هذا الإصدار
de: Dieser Dateityp wird in dieser Version nicht unterstützt
es: Este tipo de archivo no es compatible en esta versión
fr: Ce type de fichier n’est pas pris en charge dans cette version
hi: यह फ़ाइल प्रकार इस संस्करण में समर्थित नहीं है
ja: このバージョンではこのファイル形式をサポートしていません
ko: 현재 버전에서는 이 파일 형식을 열 수 없습니다
pt: Este tipo de arquivo não é compatível nesta versão
ru: Этот тип файла не поддерживается в этой версии
zh: 当前版本不支持此文件格式
zh_tw: 目前版本不支援此檔案格式
